clear;
close all;
clc;

% t = [1 2 3 4 5];
% a = [50; 1; 1; 1.25 ; 1.5];
% c = [5 5 5 5 5; 5 5 5 5 5; 5 5 5 5 5; 5 5 5 5 5; 5 5 5 5 5];
population_size = 10;
incoming_rate = 100;
parent1 = [1; 2; 3; 4; 5; 6];
parent2 =[2; 3; 4; 5; 6; 7];
child = [1; 2; 3; 4; 5];
mutation_rate = 0.9;

t = [ 0  0    0   0   0   0   0   0  0; 
     10  0    0   0   0   0   0   0  0; 
     10  0    0   0   0   0   0   0  0; 
     10  0    0   0   0   0   0   0  0; 
     10  10  10   0   0   0   0   0  0; 
      0  10   0   0  10   0   0   0  0; 
      0  0   10  10  10   0   0   0  0; 
      0  0    0  10   0   0  10   0  0; 
      0  0    0   0  10  10  10  10  0];

a = [0     0    0    0     0  0  0  0  0; 
     1.25  0    0    0     0  0  0  0  0; 
     1.25  0    0    0     0  0  0  0  0; 
     1.25  0    0    0     0  0  0  0  0; 
     1.25  1.5  1.5  0     0  0  0  0  0; 
     0     1.5  0    0     1  0  0  0  0; 
     0     0    1.5  1.5   1  0  0  0  0; 
     0     0    0    1.25  0  0  1  0  0; 
     0     0    0    0     1  1  1  1  0];

c = [0      0     0      0      0      0      0      0      0; 
     49.19  0     0      0      0      0      0      0      0; 
     21.56  0     0      0      0      0      0      0      0; 
     54.13  0     0      0      0      0      0      0      0; 
     34.08 47.24  24.87  0      0      0      0      0      0; 
     0     33.97  0      0      26.89  0      0      0      0; 
     0      0     29.96  21.84  39.98  0      0      0      0; 
     0      0     0      33.03  0      0      37.12  0      0; 
     0      0     0      0      32.76  59.73  53.83  61.65  0];


[x0, Aeq, beq, lb, ub] = initialization(t, a, c, incoming_rate); %να κανω τα x0 aeq beq
population = create_new_member(lb, ub, population_size);
[child1, child2] = crossover(population(:,:,1), population(:,:,2));
mutant = mutate(child1, lb, ub, mutation_rate); % ισως να το κανω να δινει και μικροτερες τιμες πιο πολυ γιατι δινει μονο μεγαλυτερες
fit = fitness(population, t, a, c, incoming_rate) % Δεν ξερω αν το fitness κανει σωστα τις δυο πρωτες στυλες


% best_solution(:,:,1) =[1.5071    0.2023    0.8261    0.3691    0.8745];
% 
% 
% best_solution(:,:,2) = [0.2168    2.1027    0.0021    0.4692    1.8473];
%    
% best_solution = min(best_solution,[],3)
%% Στον 2D
% στον x ειναι οι δρομοι
% στον y το population του καθε δρομου

%% Στον 3D
% στον x το απο τον κομβο 1 στον 2
% στον y το απο τον κομβο 2 στον 1
% στον z το population